Wavetrend/RX14XX-TestApp/main.c
typedef struct {
    wthal_observer_t * volatile head;
} wthal_observers_t;

void wthal_observers_dispatch(wthal_observers_t * const self) {
    wthal_observer_t * el, * tmp;
    DL_FOREACH_SAFE(self->head, el, tmp) {
        el->callback(el->context, el->error);
    }
}

wthal_observer_t * wthal_observers_head(wthal_observers_t * const self) {
    return self->head;
}

bool wthal_observers_add(wthal_observers_t * const self, wthal_observer_t * const elem) {
    DL_APPEND(self->head, elem);
    return true;
}

bool wthal_observers_delete(wthal_observers_t * const self, wthal_observer_t * const elem) {
    DL_DELETE(self->head, elem);
    return true;
}

typedef struct {
    
    bool (*enable)(void * const context, bool const enable, wt_error_t * const error);
    bool (*set_flag)(void * const context, bool const set, wt_error_t * const error);
    bool (*get_flag)(void * const context, wt_error_t * const error);
    bool (*set_priority)(void * const context, uint8_t const priority, wt_error_t * const error);
    uint8_t (*get_priority)(void * const context, wt_error_t * const error);
    bool (*add_observer)(void * const context, wthal_observer_callback_t callback, void * const callback_context, wt_error_t * const error);
    
} wthal_isr_impl_t;

typedef struct {
    
    wthal_isr_impl_t * impl;
    void * context;
    
} wthal_isr_t;

typedef enum {
    wthal_isr_priority_1 = 1,
    wthal_isr_priority_2 = 2,
    wthal_isr_priority_3 = 3,
    wthal_isr_priority_4 = 4,
    wthal_isr_priority_5 = 5,
    wthal_isr_priority_6 = 6,
    wthal_isr_priority_7 = 7,
} wthal_isr_priority_t;

wthal_isr_t * const wthal_isr_init(wthal_isr_t * const self, wthal_isr_impl_t * const impl, void * const context, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    if (ok) {
        self->impl = impl;
        self->context = context;
    }
    return ok ? self : NULL;
}

bool wthal_isr_enable(wthal_isr_t * const self, bool const enable, wt_error_t * const error) {
    return self->impl->enable(self->context, enable, error);
}

bool wthal_isr_set_flag(wthal_isr_t * const self, bool const set, wt_error_t * const error) {
    return self->impl->set_flag(self->context, set, error);
}

bool wthal_isr_get_flag(wthal_isr_t * const self, wt_error_t * const error) {
    return self->impl->get_flag(self->context, error);
}

bool wthal_isr_set_priority(wthal_isr_t * const self, uint8_t const priority, wt_error_t * const error) {
    return self->impl->set_priority(self->context, priority, error);
}

bool wthal_isr_get_priority(wthal_isr_t * const self, wt_error_t * const error) {
    return self->impl->get_priority(self->context, error);
}

bool wthal_isr_add_observer(wthal_isr_t * const self, wthal_observer_callback_t callback, void * const context, wt_error_t * const error) {
    return self->impl->add_observer(self->context, callback, context, error);
}

#define WTHAL_ISR_DECLARE(NAME) \
    typedef struct { \
        wthal_isr_t isr; \
    } NAME ## _t; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const self, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error);

#define WTHAL_ISR_DEFINE(NAME, ISR, IF, IE, IP) \
    static wthal_observers_t NAME ## _active = {}; \
    static wthal_observers_t NAME ## _inactive = {}; \
    void __attribute__ (( interrupt, no_auto_psv )) ISR ( void ) { \
        wthal_observers_dispatch(&NAME ## _active); \
        IF = 0; \
    } \
    static bool NAME ## _enable_impl(void * const context, bool const enable, wt_error_t * const error) { \
        IE = enable; \
        return true; \
    } \
    static bool NAME ## _set_flag_impl(void * const context, bool const set, wt_error_t * const error) { \
        IF = set; \
        return true; \
    } \
    static bool NAME ## _get_flag_impl(void * const context, wt_error_t * const error) { \
        return IF; \
    } \
    static bool NAME ## _set_priority_impl(void * const context, uint8_t const priority, wt_error_t * const error) { \
        IP = priority; \
        return true; \
    } \
    static uint8_t NAME ## _get_priority_impl(void * const context, wt_error_t * const error) { \
        return IP; \
    } \
    static bool NAME ## _add_observer_impl(void * const context, wthal_observer_callback_t callback, void * const callback_context, wt_error_t * const error) { \
        wthal_observer_t * elem = wthal_observers_head(&NAME ## _inactive); \
        bool ok = true; \
        ok = !ok ? ok : wt_assert(elem != NULL, WT_ERROR_ENOSPC, error); \
        if (ok) { \
            wthal_observers_delete(&NAME ## _inactive, elem); \
            elem->callback = callback; \
            elem->context = callback_context; \
            elem->error = error; \
            wthal_observers_add(&NAME ## _active, elem); \
        } \
        return ok; \
    } \
    static wthal_isr_impl_t NAME ## _impl = { \
        .enable = NAME ## _enable_impl, \
        .add_observer = NAME ## _add_observer_impl, \
        .set_flag = NAME ## _set_flag_impl, \
        .get_flag = NAME ## _get_flag_impl, \
        .set_priority = NAME ## _set_priority_impl, \
        .get_priority = NAME ## _get_priority_impl, \
    }; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const self, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error) { \
        IE = 0; \
        IF = 0; \
        IP = interrupt_priority; \
        for (size_t i=0 ; i < size ; i++) { \
            wthal_observers_add(&NAME ## _inactive, &observers[i]); \
        } \
        return wthal_isr_init(&self->isr, &NAME ## _impl, self, error); \
    }

///////////////////////////////// GPIO ///////////////////////////////////////

typedef struct {

    bool (*set)(void * const, bool const high, wt_error_t * const error);
    bool (*toggle)(void * const, wt_error_t * const error);
    bool (*get)(void * const context, wt_error_t * const error);
    bool (*input)(void * const context, bool const input, wt_error_t * const error);
    bool (*analogue)(void * const context, bool const analogue, wt_error_t * const error);
    bool (*weak_pull_up)(void * const context, bool const enable, wt_error_t * const error);
    bool (*weak_pull_down)(void * const context, bool const enable, wt_error_t * const error);
    bool (*output_drain)(void * const context, bool const enable, wt_error_t * const error);
    
} wthal_gpio_impl_t;

