Wavetrend/RX14XX-TestApp/main.c
#define WTHAL_UART_DECLARE(NAME) \
    WTHAL_ISR_DECLARE(NAME ## _tx) \
    WTHAL_ISR_DECLARE(NAME ## _rx) \
    WTHAL_ISR_DECLARE(NAME ## _err) \
    typedef struct { \
        uint32_t baudrate; \
        bool flowcontrol; \
        wthal_uart_t uart; \
        wthal_isr_t * tx_isr; \
        wthal_isr_t * rx_isr; \
        wthal_isr_t * err_isr; \
        NAME ## _tx_t _tx_isr; \
        NAME ## _rx_t _rx_isr; \
        NAME ## _err_t _err_isr; \
        wthal_observer_t tx_observers[1]; \
        wthal_observer_t rx_observers[1]; \
        wthal_observer_t err_observers[1]; \
        wt_rx14xx_uint8_buffer_t tx_buffer; \
        wt_rx14xx_uint8_buffer_t rx_buffer; \
        uint8_t tx_storage[256]; \
        uint8_t rx_storage[256]; \
    } NAME ## _t; \
    wthal_uart_t * const NAME ## _init(NAME ## _t * const self, uint32_t const baudrate, bool const flowcontrol, wthal_isr_priority_t const tx_priority, wthal_isr_priority_t const rx_priority, wthal_isr_priority_t const err_priority, wt_error_t * const error);

#define WTHAL_UART_DEFINE(NAME, UART, XTAL) \
    WTHAL_ISR_DEFINE(NAME ## _tx, UART_TX_ISR(UART), UART_TXIF(UART), UART_TXIE(UART), UART_TXIP(UART)); \
    WTHAL_ISR_DEFINE(NAME ## _rx, UART_RX_ISR(UART), UART_RXIF(UART), UART_RXIE(UART), UART_RXIP(UART)); \
    WTHAL_ISR_DEFINE(NAME ## _err, UART_ERR_ISR(UART), UART_ERIF(UART), UART_ERIE(UART), UART_ERIP(UART)); \
    static void NAME ## _tx_isr_impl(void * const context, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        while (! UART_TXBF(UART)) { \
            uint8_t data; \
            if (wt_rx14xx_uint8_buffer_read(&self->tx_buffer, &data, sizeof(data), error)) { \
                UART_TXREG(UART) = data; \
            } else { \
                wthal_isr_enable(self->tx_isr, false, error); \
                break; \
            } \
        } \
    } \
    static void NAME ## _rx_isr_impl(void * const context, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        bool ok = true; \
        while (ok && UART_RXDA(UART)) { \
            uint8_t data = UART_RXREG(UART); \
            ok = !ok ? ok : wt_rx14xx_uint8_buffer_write(&self->rx_buffer, &data, sizeof(data), error); \
        } \
    } \
    static void NAME ## _err_isr_impl(void * const context, wt_error_t * const error) { \
        if (UART_OERR(UART) == 1) { \
            UART_OERR(UART) = 0; \
        } \
    } \
    static bool NAME ## _open_impl(void * const context, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        UART_MODE(UART) = 0x0000; \
        UART_BRGH(UART) = 1; \
        UART_STA(UART) = 0x0000; \
        wthal_uart_baudrate(&self->uart, self->baudrate, error); \
        wthal_uart_flowcontrol(&self->uart, self->flowcontrol, error); \
        wthal_isr_enable(self->tx_isr, false, error); \
        wthal_isr_enable(self->rx_isr, true, error); \
        wthal_isr_enable(self->err_isr, true, error); \
        UART_UARTEN(UART) = 1; \
        UART_TXEN(UART) = 1; \
        return true; \
    } \
    static bool NAME ## _close_impl(void * const context, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        wthal_isr_enable(self->tx_isr, false, error); \
        wthal_isr_enable(self->rx_isr, false, error); \
        wthal_isr_enable(self->err_isr, false, error); \
        UART_UARTEN(UART) = 0; \
        UART_TXEN(UART) = 0; \
        return true; \
    } \
    static bool NAME ## _baudrate_impl(void * const context, uint32_t const baudrate, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        self->baudrate = baudrate; \
        UART_BRG(UART) = (XTAL / (4 * self->baudrate)) - 1; \
        return true; \
    } \
    static bool NAME ## _flowcontrol_impl(void * const context, bool const flowcontrol, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        self->flowcontrol = flowcontrol; \
        UART_EN(UART) = self->flowcontrol ? 2 : 0; \
        return true; \
    } \
    static size_t NAME ## _read_impl(void * const context, void * const data, size_t const size, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        return wt_rx14xx_uint8_buffer_read(&self->rx_buffer, data, size, error); \
    } \
    static size_t NAME ## _write_impl(void * const context, void const * const data, size_t const size, wt_error_t * const error) { \
        NAME ## _t * const self = context; \
        bool ok = true; \
        size_t written = wt_rx14xx_uint8_buffer_write(&self->tx_buffer, data, size, error); \
        if (written > 0) { \
            ok = !ok ? ok : wthal_isr_set_flag(self->tx_isr, true, error); \
            ok = !ok ? ok : wthal_isr_enable(self->tx_isr, true, error); \
        } \
        return written; \
    } \
    static wthal_uart_impl_t const NAME ## _impl = { \
        .open = NAME ## _open_impl, \
        .close = NAME ## _close_impl, \
        .baudrate = NAME ## _baudrate_impl, \
        .flowcontrol = NAME ## _flowcontrol_impl, \
        .read = NAME ## _read_impl, \
        .write = NAME ## _write_impl, \
    }; \
    wthal_uart_t * const NAME ## _init(NAME ## _t * const self, uint32_t const baudrate, bool const flowcontrol, wthal_isr_priority_t const tx_priority, wthal_isr_priority_t const rx_priority, wthal_isr_priority_t const err_priority, wt_error_t * const error) { \
        bool ok = true; \
        self->baudrate = baudrate; \
        self->flowcontrol = flowcontrol; \
        ok = !ok ? ok : (self->tx_isr = NAME ## _tx_init(&self->_tx_isr, tx_priority, self->tx_observers, 1, error)) != NULL; \
        ok = !ok ? ok : (self->rx_isr = NAME ## _rx_init(&self->_rx_isr, rx_priority, self->rx_observers, 1, error)) != NULL; \
        ok = !ok ? ok : (self->err_isr = NAME ## _err_init(&self->_err_isr, err_priority, self->err_observers, 1, error)) != NULL; \
        ok = !ok ? ok : wthal_isr_add_observer(self->tx_isr, NAME ## _tx_isr_impl, self, error); \
        ok = !ok ? ok : wthal_isr_add_observer(self->rx_isr, NAME ## _rx_isr_impl, self, error); \
        ok = !ok ? ok : wthal_isr_add_observer(self->err_isr, NAME ## _err_isr_impl, self, error); \
        ok = !ok ? ok : wt_rx14xx_uint8_buffer_init(&self->tx_buffer, self->tx_storage, 256, error); \
        ok = !ok ? ok : wt_rx14xx_uint8_buffer_init(&self->rx_buffer, self->rx_storage, 256, error); \
        return ok ? wthal_uart_init(&self->uart, &NAME ## _impl, self, error) : NULL; \
    }

