Wavetrend/RX14XX-TestApp/main.c
//////////////////////////////// STDOUT ///////////////////////////////////////

static wthal_uart_t * wthal_stdout_uart = NULL;

int __attribute__ ( ( __section__(".libc.write" ) ) ) write(int handle, void * buffer, unsigned int len) {
    if (wthal_stdout_uart != NULL) {
        return (int) wthal_uart_write(wthal_stdout_uart, buffer, len, NULL);
    }
    return 0;
}

bool wthal_set_stdout(wthal_uart_t * const uart, wt_error_t * const error) {
    wthal_stdout_uart = uart;
    return true;
}

///////////////////////////////// MAIN ///////////////////////////////////////

#define PPS_UNLOCK()    __builtin_write_OSCCONL(OSCCON & 0xbf)
#define PPS_LOCK()      __builtin_write_OSCCONL(OSCCON | 0x40)

#define XTAL (14745600)

WTHAL_UART_DECLARE(wt_rx14xx_debug_uart);
WTHAL_UART_DEFINE(wt_rx14xx_debug_uart, 2, XTAL);
WTHAL_GPIO_DECLARE(wt_rx14xx_led1);
WTHAL_GPIO_DEFINE(wt_rx14xx_led1, _RD7, _TRISD7, _LATD7, _ANSD7, _CN16PUE, _CN16PDE, _ODD7);
WTHAL_GPIO_DECLARE(wt_rx14xx_led2);
WTHAL_GPIO_DEFINE(wt_rx14xx_led2, _RD6, _TRISD6, _LATD6, _ANSD6, _CN15PUE, _CN15PDE, _ODD6);
WTHAL_GPIO_DECLARE(wt_rx1400_xpc_reset);
WTHAL_GPIO_DEFINE(wt_rx1400_xpc_reset, _RB2, _TRISB2, _LATB2, _ANSB2, _CN4PUE, _CN4PDE, _ODB2);
WTHAL_ISR_DECLARE(wt_rx14xx_tmr5);
WTHAL_ISR_DEFINE(wt_rx14xx_tmr5, _T5Interrupt, _T5IF, _T5IE, _T5IP);
WTHAL_TIMER_DECLARE(wt_rx14xx_timer5);
WTHAL_TIMER_DEFINE(wt_rx14xx_timer5, XTAL, TMR5, PR5, T5CONbits.TON, T5CONbits.TCKPS, _T5IF);

typedef struct {
    
    wthal_isr_t * t5_isr;
    wthal_gpio_t * startup_led;
    wthal_gpio_t * activity_led;
    wthal_gpio_t * xpc_reset;
    wthal_timer_t * timer5;
    wthal_counter_t * counter;
    wthal_uart_t * debug_uart;
    
} wthal_t;

#define WT_RX1400_HAL_T5_OBSERVER_SIZE          (5)

typedef struct {
    
    wthal_t hal;
    
    wthal_observer_t t5_observers[WT_RX1400_HAL_T5_OBSERVER_SIZE];
    
    wt_rx14xx_tmr5_t t5_isr;
    wt_rx14xx_led1_t startup_led;
    wt_rx14xx_led2_t activity_led;
    wt_rx1400_xpc_reset_t xpc_reset;
    wt_rx14xx_timer5_t timer5;
    wthal_counter_t counter;
    wt_rx14xx_debug_uart_t debug_uart;
    
} wt_rx1400_hal_t;

wthal_t * const wt_rx1400_hal_init(wt_rx1400_hal_t * const self, wt_error_t * const error) {
    
    bool ok = true;
    
    ok = !ok ? ok : (self->hal.t5_isr = wt_rx14xx_tmr5_init(&self->t5_isr, wthal_isr_priority_4, self->t5_observers, WT_RX1400_HAL_T5_OBSERVER_SIZE, error)) != NULL;
    ok = !ok ? ok : (self->hal.startup_led = wt_rx14xx_led1_init(&self->startup_led, error)) != NULL;
    ok = !ok ? ok : (self->hal.activity_led = wt_rx14xx_led2_init(&self->activity_led, error)) != NULL;
    ok = !ok ? ok : (self->hal.xpc_reset = wt_rx1400_xpc_reset_init(&self->xpc_reset, error)) != NULL;
    ok = !ok ? ok : (self->hal.timer5 = wt_rx14xx_timer5_init(&self->timer5, wt_rx14xx_timer_prescale_1, error)) != NULL;
    ok = !ok ? ok : (self->hal.counter = wthal_counter_init(&self->counter, error)) != NULL;
    ok = !ok ? ok : (self->hal.debug_uart = wt_rx14xx_debug_uart_init(&self->debug_uart, 230400, true, wthal_isr_priority_4, wthal_isr_priority_4, wthal_isr_priority_4, error)) != NULL;
    
    ok = !ok ? ok : wthal_gpio_weak_pull_up(self->hal.xpc_reset, true, error);
    
    ok = !ok ? ok : wthal_isr_add_observer(self->hal.t5_isr, wthal_counter_isr, self->hal.counter, error);
    ok = !ok ? ok : wthal_isr_enable(self->hal.t5_isr, true, error);
    ok = !ok ? ok : wthal_timer_start(self->hal.timer5, 1, error);
    
    ok = !ok ? ok : wthal_uart_open(self->hal.debug_uart, error);
    ok = !ok ? ok : wthal_set_stdout(self->hal.debug_uart, error);
    
    return ok ? &self->hal : NULL;
    
}

int app_main(wthal_t * const hal, wt_error_t * const error) {

    uint32_t count = 0;
    bool ok = true;
    
    ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
    ok = !ok ? ok : wthal_gpio_set(hal->startup_led, true, error);
    while (ok && wthal_counter_get(hal->counter, error) < 3000) {
        ClrWdt();
        Nop();
    }
    ok = !ok ? ok : wthal_gpio_set(hal->startup_led, false, error);
    
    while (ok)
    {
        // Add your application code
        ok = !ok ? ok : wthal_gpio_set(hal->activity_led, true, error);
        ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
        while(wthal_counter_get(hal->counter, error) < 1000) {
            ClrWdt();
            Nop();
        }
        ok = !ok ? ok : wthal_gpio_set(hal->activity_led, false, error);
        ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
        while(wthal_counter_get(hal->counter, error) < 1000) {
            ClrWdt();
            Nop();
        }
        for (size_t i=0 ; i < 1 ; i++) {
            printf("\nHello World %ld", (uint32_t)count++);        
        }
    }

    return 1;

}

int main(void)
{
    wt_error_t error;
    
    // initialize the device - MUST COME FIRST OR WILL OVERRIDE HAL STYLE CONFIG
    SYSTEM_Initialize();

    PPS_UNLOCK();

    _U2RXR = 23;                // UART2:U2RX->RP23/RD2
    _RP22R = _RPOUT_U2TX;       // RP22/RD3->UART2:U2TX

    PPS_LOCK();
    
    wt_rx1400_hal_t rx1400_hal;
    wthal_t * hal = wt_rx1400_hal_init(&rx1400_hal, &error);
 
    if (hal != NULL) { 
        return app_main(hal, &error);
    }
    
    return -1;

}
/**
 End of File
*/

